In [1]:
import numpy as np
import pandas as pd

In [2]:
train_data = pd.read_csv('TITANIC_Folds.csv')
test_data = pd.read_csv('test.csv')

In [3]:
train_data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,fold
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,1
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,4
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,2
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,4

In [4]:
test_data.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [5]:
train_data.drop('Cabin',axis= 1,inplace= True)
test_data.drop('Cabin',axis= 1,inplace= True)
train_data['Age'] = train_data['Age'].fillna(int(train_data['Age'].mean()))
test_data['Age'] = test_data['Age'].fillna(int(test_data['Age'].mean()))
train_data['Embarked'] = train_data['Embarked'].fillna(train_data['Embarked'].mode()[0])
test_data['Fare'] = test_data['Fare'].fillna(test_data['Fare'].median())
train_data['isTrain'] = 1
test_data['isTrain'] = 0
tt = pd.concat([train_data,test_data])
tt.drop(['Name','Ticket'],axis=1,inplace = True)
tt = pd.get_dummies(tt,columns= ['Sex','Embarked'],drop_first = True)
train_data = tt[tt.isTrain == 1]
test_data = tt[tt.isTrain == 0]
test_data.drop(['Survived','isTrain', 'fold'],axis=1,inplace = True)
train_data.drop(['isTrain'],axis=1,inplace= True)

# Note don't drop PassengerId column of train_data and test_data as it is used later. Instead drop it only for test and my_folds
useful_features = test_data.drop('PassengerId',axis=1).columns.tolist() #########################################
test = test_data[useful_features]
my_folds = train_data.copy()

/home/proky/anaconda3/lib/python3.9/site-packages/pandas/core/frame.py:4906: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  return super().drop(

In [6]:
train_data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 891 entries, 0 to 890
Data columns (total 11 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    float64
 2   Pclass       891 non-null    int64
 3   Age          891 non-null    float64
 4   SibSp        891 non-null    int64
 5   Parch        891 non-null    int64
 6   Fare         891 non-null    float64
 7   fold         891 non-null    float64
 8   Sex_male     891 non-null    uint8
 9   Embarked_Q   891 non-null    uint8
 10  Embarked_S   891 non-null    uint8
dtypes: float64(4), int64(4), uint8(3)
memory usage: 65.3 KB

In [7]:
test_data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 418 entries, 0 to 417
Data columns (total 9 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  418 non-null    int64
 1   Pclass       418 non-null    int64
 2   Age          418 non-null    float64
 3   SibSp        418 non-null    int64
 4   Parch        418 non-null    int64
 5   Fare         418 non-null    float64
 6   Sex_male     418 non-null    uint8
 7   Embarked_Q   418 non-null    uint8
 8   Embarked_S   418 non-null    uint8
dtypes: float64(2), int64(4), uint8(3)
memory usage: 24.1 KB

In [8]:
print(test.shape, my_folds.shape, useful_features)

(418, 8) (891, 11) ['Pclass', 'Age', 'SibSp', 'Parch', 'Fare', 'Sex_male', 'Embarked_Q', 'Embarked_S']

In [9]:
print(my_folds.columns.tolist())

['PassengerId', 'Survived', 'Pclass', 'Age', 'SibSp', 'Parch', 'Fare', 'fold', 'Sex_male', 'Embarked_Q', 'Embarked_S']